# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundarySegment..::..Dispose Method
BoundarySegment Class See Also
---
Releases all resources used by the BoundarySegment
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace